borisnimcevic/doom-bcd/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16 MB flash, custom partitions with a 12 MB SPIFFS for the WAD
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Octal PSRAM, matching the badge — DOOM's zone heap lives here
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_CLK_IO=30
CONFIG_SPIRAM_CS_IO=26
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# Speed
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# DOOM's main task recurses through the BSP tree — give it room
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# SPIFFS: allow the ~4 MB single WAD file
CONFIG_SPIFFS_OBJ_NAME_LEN=32
CONFIG_SPIFFS_PAGE_SIZE=256

# quieter logs while it runs
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# DOOM's one-time R_Init reads textures from slow SPIFFS and starves the
# idle task; don't let the task watchdog trip on it.
CONFIG_ESP_TASK_WDT_INIT=n
